# Используем актуальный и легковесный образ Node.js
FROM node:20-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем весь код проекта сразу, так как исходники нужны
# для корректной компиляции Tailwind CSS на этапе установки
COPY . .

# Устанавливаем ВСЕ зависимости.
# В конце установки автоматически выполнится скрипт prepare и соберет CSS.
RUN npm install

# Удаляем dev-зависимости, оставляя только то, что нужно для работы (production)
RUN npm prune --omit=dev

# Прокси по умолчанию использует порт 8080
EXPOSE 8080

# Запускаем приложение через встроенный CLI скрипт
CMD ["node", "src/index.js"]